# DBeam_SetRShutAngle

```pascal
PROCEDURE DBeam_SetRShutAngle(angle : REAL);
```

```python
def vs.DBeam_SetRShutAngle(angle):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|angle|REAL|   |

## Examples
```pascal
DBeam_SetRShutAngle(1.0);
```
```python
import vs

angle = 45.0

vs.DBeam_SetRShutAngle(angle)
```

## Version
Availability: from Vectorworks 2011

## Category
* Spotlight